{"config": {"name": "model_2", "layers": [{"name": "input_2", "config": {"name": "input_2", "dtype": "int32", "batch_input_shape": [null, 1000], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"name": "embedding_1", "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "batch_input_shape": [null, 1000], "input_dim": 140457, "mask_zero": false, "trainable": false, "dtype": "int32", "activity_regularizer": null, "output_dim": 100, "input_length": 1000, "embeddings_regularizer": null, "embeddings_constraint": null}, "class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "conv1d_4", "config": {"kernel_constraint": null, "name": "conv1d_4", "kernel_size": [5], "use_bias": true, "filters": 128, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [1], "padding": "valid", "activation": "relu", "dilation_rate": [1]}, "class_name": "Conv1D", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "max_pooling1d_4", "config": {"strides": [5], "name": "max_pooling1d_4", "padding": "valid", "pool_size": [5], "trainable": true}, "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"name": "conv1d_5", "config": {"kernel_constraint": null, "name": "conv1d_5", "kernel_size": [5], "use_bias": true, "filters": 128, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [1], "padding": "valid", "activation": "relu", "dilation_rate": [1]}, "class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}]]]}, {"name": "max_pooling1d_5", "config": {"strides": [5], "name": "max_pooling1d_5", "padding": "valid", "pool_size": [5], "trainable": true}, "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"name": "conv1d_6", "config": {"kernel_constraint": null, "name": "conv1d_6", "kernel_size": [5], "use_bias": true, "filters": 128, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [1], "padding": "valid", "activation": "relu", "dilation_rate": [1]}, "class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_5", 0, 0, {}]]]}, {"name": "max_pooling1d_6", "config": {"strides": [35], "name": "max_pooling1d_6", "padding": "valid", "pool_size": [35], "trainable": true}, "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_6", 0, 0, {}]]]}, {"name": "flatten_2", "config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["max_pooling1d_6", 0, 0, {}]]]}, {"name": "dropout_3", "config": {"name": "dropout_3", "rate": 0.2, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"name": "dense_4", "config": {"kernel_constraint": null, "name": "dense_4", "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 128, "activation": "relu"}, "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "dropout_4", "config": {"name": "dropout_4", "rate": 0.3, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"name": "dense_5", "config": {"kernel_constraint": null, "name": "dense_5", "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 128, "activation": "relu"}, "class_name": "Dense", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "dense_6", "config": {"kernel_constraint": null, "name": "dense_6", "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 2, "activation": "softmax"}, "class_name": "Dense", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_6", 0, 0]]}, "backend": "theano", "class_name": "Model", "keras_version": "2.0.3"}